Autodesk.Revit.DB.TableCellStyle.SetCellStyleOverrideOptions(Autodesk.Revit.DB.TableCellStyleOverrideOptions)
Sets cell style override options of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.TableCellStyle.BorderRightLineStyle
The element id (GraphicsStyle element) for the right line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.BorderLeftLineStyle
The element id (GraphicsStyle element) for the left line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.BorderBottomLineStyle
The element id (GraphicsStyle element) for the bottom line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.BorderTopLineStyle
The element id (GraphicsStyle element) for the top line of the cell border.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.BackgroundColor
The background color of this cell in the grid view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.TextColor
The text color of this cell.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.FontName
The font used for this style
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellStyle.#ctor(Autodesk.Revit.DB.TableCellStyle)
Constructs a new copy of the input TableCellStyle object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null